In [72]:
import pandas as pd
import numpy as np
 
# Define a dictionary containing employee data
data = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj','Mulati'],
        'Age':[27, 24, 22, 32,32],
        'Address':['Delhi', 'Kanpur', 'Allahabad', 'Kannauj','Kanpur'],
        'Qualification':['Msc', 'MA', 'MCA', 'Phd','MCA']}
 
# Convert the dictionary into DataFrame 
df = pd.DataFrame(data)
 
# select two columns
print(df[['Name', 'Qualification']])

     Name Qualification
0     Jai           Msc
1  Princi            MA
2  Gaurav           MCA
3    Anuj           Phd
4  Mulati           MCA

In [37]:
df.set_index("Name", inplace = True ,drop =True)

In [16]:
df.iloc[:1,0:2]

      Age Address
Name
Jai    27   Delhi

In [38]:
df.loc['Jai']

Age                 27
Address          Delhi
Qualification      Msc
Name: Jai, dtype: object

In [34]:
df

          Name  Age    Address Qualification
Name
Jai        Jai   27      Delhi           Msc
Princi  Princi   24     Kanpur            MA
Gaurav  Gaurav   22  Allahabad           MCA
Anuj      Anuj   32    Kannauj           Phd

In [43]:
# iterating over rows using iterrows() function 
for i, j in df.iterrows():
    print(i,j)
    print()

Jai Age                 27
Address          Delhi
Qualification      Msc
Name: Jai, dtype: object

Princi Age                  24
Address          Kanpur
Qualification        MA
Name: Princi, dtype: object

Gaurav Age                     22
Address          Allahabad
Qualification          MCA
Name: Gaurav, dtype: object

Anuj Age                   32
Address          Kannauj
Qualification        Phd
Name: Anuj, dtype: object

In [50]:
# creating a list of dataframe columns
columns = list(df)
 
for i in columns:
 
    # printing the third element of the column
    print (df[i])
    print()

0       Jai
1    Princi
2    Gaurav
3      Anuj
Name: Name, dtype: object

0    27
1    24
2    22
3    32
Name: Age, dtype: int64

0        Delhi
1       Kanpur
2    Allahabad
3      Kannauj
Name: Address, dtype: object

0    Msc
1     MA
2    MCA
3    Phd
Name: Qualification, dtype: object

In [51]:
for key, value in df.iteritems(): 
    print(key, value) 
    print()

Name 0       Jai
1    Princi
2    Gaurav
3      Anuj
Name: Name, dtype: object

Age 0    27
1    24
2    22
3    32
Name: Age, dtype: int64

Address 0        Delhi
1       Kanpur
2    Allahabad
3      Kannauj
Name: Address, dtype: object

Qualification 0    Msc
1     MA
2    MCA
3    Phd
Name: Qualification, dtype: object

In [52]:
# using a itertuples()  
for i in df.itertuples(): 
    print(i)

Pandas(Index=0, Name='Jai', Age=27, Address='Delhi', Qualification='Msc')
Pandas(Index=1, Name='Princi', Age=24, Address='Kanpur', Qualification='MA')
Pandas(Index=2, Name='Gaurav', Age=22, Address='Allahabad', Qualification='MCA')
Pandas(Index=3, Name='Anuj', Age=32, Address='Kannauj', Qualification='Phd')

In [53]:
df.all()

Name             True
Age              True
Address          True
Qualification    True
dtype: bool

In [54]:
df.Name.all()

'Anuj'

In [55]:
df.all(axis ='columns')

0    True
1    True
2    True
3    True
dtype: bool

In [56]:
df.groupby('Name') 
print(df.groupby('Name').groups)

{'Anuj': Int64Index([3], dtype='int64'), 'Gaurav': Int64Index([2], dtype='int64'), 'Jai': Int64Index([0], dtype='int64'), 'Princi': Int64Index([1], dtype='int64')}

In [61]:
df.groupby('Qualification') .first()

                 Name  Age    Address
Qualification
MA             Princi   24     Kanpur
MCA            Gaurav   22  Allahabad
Msc               Jai   27      Delhi
Phd              Anuj   32    Kannauj

In [62]:
df.groupby(['Name'], sort = False).sum()

        Age
Name
Jai      27
Princi   24
Gaurav   22
Anuj     32
Mulati   32

In [64]:
df.groupby(['Name'], sort = True).sum()

        Age
Name
Anuj     32
Gaurav   22
Jai      27
Mulati   32
Princi   24

In [66]:
df.groupby('Qualification').groups

{'MA': Int64Index([1], dtype='int64'),
 'MCA': Int64Index([2, 4], dtype='int64'),
 'Msc': Int64Index([0], dtype='int64'),
 'Phd': Int64Index([3], dtype='int64')}

In [69]:
grp = df.groupby('Name') 
  
grp['Age'].agg([np.sum, np.mean, np.std])

        sum  mean  std
Name
Anuj     32    32  NaN
Gaurav   22    22  NaN
Jai      27    27  NaN
Mulati   32    32  NaN
Princi   24    24  NaN

In [78]:
grp = df.groupby('Name') 
grp.agg({'Age' : 'sum' ,'Address' :'max'})

        Age    Address
Name
Anuj     32    Kannauj
Gaurav   22  Allahabad
Jai      27      Delhi
Mulati   32     Kanpur
Princi   24     Kanpur

In [79]:
# importing pandas module 
import pandas as pd 

# importing numpy as np 
import numpy as np 

# Define a dictionary containing employee data 
data1 = {'Name':['Jai', 'Anuj', 'Jai', 'Princi', 
				'Gaurav', 'Anuj', 'Princi', 'Abhi'], 
		'Age':[27, 24, 22, 32, 
			33, 36, 27, 32], 
		'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj', 
				'Jaunpur', 'Kanpur', 'Allahabad', 'Aligarh'], 
		'Qualification':['Msc', 'MA', 'MCA', 'Phd', 
						'B.Tech', 'B.com', 'Msc', 'MA'], 
		'Score': [23, 34, 35, 45, 47, 50, 52, 53]} 
	

# Convert the dictionary into DataFrame 
df = pd.DataFrame(data1) 

print(df)

     Name  Age    Address Qualification  Score
0     Jai   27     Nagpur           Msc     23
1    Anuj   24     Kanpur            MA     34
2     Jai   22  Allahabad           MCA     35
3  Princi   32    Kannuaj           Phd     45
4  Gaurav   33    Jaunpur        B.Tech     47
5    Anuj   36     Kanpur         B.com     50
6  Princi   27  Allahabad           Msc     52
7    Abhi   32    Aligarh            MA     53

In [80]:
grp = df.groupby('Qualification') 
grp.filter(lambda x: len(x) >= 2)

     Name  Age    Address Qualification  Score
0     Jai   27     Nagpur           Msc     23
1    Anuj   24     Kanpur            MA     34
6  Princi   27  Allahabad           Msc     52
7    Abhi   32    Aligarh            MA     53

In [81]:
df.groupby('Qualification').filter(lambda x: len(x) >= 2)

     Name  Age    Address Qualification  Score
0     Jai   27     Nagpur           Msc     23
1    Anuj   24     Kanpur            MA     34
6  Princi   27  Allahabad           Msc     52
7    Abhi   32    Aligarh            MA     53

In [82]:
df.groupby('Name') .transform(lambda x: (x - x.mean()) / x.std()*10)

        Age     Score
0  7.071068 -7.071068
1 -7.071068 -7.071068
2 -7.071068  7.071068
3  7.071068 -7.071068
4       NaN       NaN
5  7.071068  7.071068
6 -7.071068  7.071068
7       NaN       NaN

In [117]:
# importing pandas as pd 
import pandas as pd 

# Create dictionary with data 
dict = { 
	"ID":[1, 2, 3], 
	"Movies":["The Godfather", "Fight Club", "Casablanca"], 
	"Week_1_Viewers":[30, 30, 40], 
	"Week_2_Viewers":[60, 40, 80], 
	"Week_3_Viewers":[40, 20, 20] }; 

# Convert dictionary to dataframe 
df = pd.DataFrame(dict); 
print(df)

   ID         Movies  Week_1_Viewers  Week_2_Viewers  Week_3_Viewers
0   1  The Godfather              30              60              40
1   2     Fight Club              30              40              20
2   3     Casablanca              40              80              20

In [118]:
# Create the groupby_dict 
groupby_dict = {"Week_1_Viewers":"Total_Viewers", 
		"Week_2_Viewers":"Total_Viewers", 
		"Week_3_Viewers":"Total_Viewers", 
		"Movies":"Movies" } 

df = df.set_index('ID') 
df = df.groupby(groupby_dict, axis = 1).sum() 
print(df)

           Movies  Total_Viewers
ID
1   The Godfather            130
2      Fight Club             90
3      Casablanca            140

In [95]:
groupby_dict

{'Week_1_Viewers': 'Total_Viewers',
 'Week_2_Viewers': 'Total_Viewers',
 'Week_3_Viewers': 'Total_Viewers',
 'Movies': 'Movies'}

In [115]:
# df = df.set_index('ID') 
df = df.groupby(groupby_dict ,axis=1).sum() 
print(df)

           Movies  Total_Viewers
ID
1   The Godfather            130
2      Fight Club             90
3      Casablanca            140